{"pages":[{"title":"About Minos","text":"A simple and retro styled Hexo theme, concentrating more on your ideas. Preview | Download | Documentation (Coming soon)  FeaturesExtensive Plugin Support Minos includes plentiful search, comment, sharing and other plugins out of the box. You can choose any of them to enrich your blog experience, or build your own plugin easily referring to the existing Minos plugins. Comment plugins Changyan Disqus Facebook comments plugin Gitment Isso LiveRe Valine Youyan Search plugins Insight Search Google custom search Share plugins AddThis ShareThis Other plugins Hexo Tag Plugin lightGallery &amp; Justified Gallery MathJax Rich Code Highlight Theme Choices Minos directly import code highlight themes from the highlight.js package, and makes more than 70 highlight themes available to you. Elastic Theme Configuration In addition to the minimalistic and easy-to-understand configuration design, Minos allows you to set configurations on a per-page and per-language basis with the ability to merge and override partial configurations. _config.yml 123menu: Archives: /archives Lifestyle: /categories/LifeStyle _config.zh-cn.yml 123menu: 归档: /archives 生活: /categories/LifeStyle post.md 12345title: A Simple Postmenu: Go Home: /index.html---# Here is some simple markdown. Multi-language Support Minos supports the using of multiple translations on different pages in one site with its elastic configuration system. Simply decide your preferred language for each page (or use the language folder) and create an additional _config.&lt;language shortname&gt;.yml, then you are ready to go. Responsive Layout No matter what modern browsering device your audiences are using, they can always get the best experience because Minos’s responsive layout across multiple viewpoints.  InstallationDownload &amp; extract or git clone Minos from GitHub to your blog’s theme folder, and that’s it! 1git clone https://github.com/ppoffice/hexo-theme-minos.git themes/minos Once started, Minos will remind you of any missing dependencies and configuration files.  DevelopmentThis project is built with Hexo 3.6.0 Ejs Sass Please refer to the documentation for Minos implementation details.  Contribute  Write a plugin  Report a bug  Add a translation  LicenseThis project is licensed under the MIT License - see the LICENSE file for details. document.querySelectorAll('.not-gallery-item') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","link":"/hexo-theme-minos/zh-cn/about/index.html"}],"posts":[{"title":"中文测试","text":"桃花源记朝代：魏晋作者：陶渊明原文：　　晋太元中，武陵人捕鱼为业。缘溪行，忘路之远近。忽逢桃花林，夹岸数百步，中无杂树，芳草鲜美，落英缤纷，渔人甚异之。复前行，欲穷其林。 　　林尽水源，便得一山，山有小口，仿佛若有光。便舍船，从口入。初极狭，才通人。复行数十步，豁然开朗。土地平旷，屋舍俨然，有良田美池桑竹之属。阡陌交通，鸡犬相闻。其中往来种作，男女衣着，悉如外人。黄发垂髫，并怡然自乐。 　　见渔人，乃大惊，问所从来。具答之。便要还家，设酒杀鸡作食。村中闻有此人，咸来问讯。自云先世避秦时乱，率妻子邑人来此绝境，不复出焉，遂与外人间隔。问今是何世，乃不知有汉，无论魏晋。此人一一为具言所闻，皆叹惋。余人各复延至其家，皆出酒食。停数日，辞去。此中人语云：“不足为外人道也。”(间隔 一作：隔绝) 　　既出，得其船，便扶向路，处处志之。及郡下，诣太守，说如此。太守即遣人随其往，寻向所志，遂迷，不复得路。 　　南阳刘子骥，高尚士也，闻之，欣然规往。未果，寻病终，后遂无问津者。 document.querySelectorAll('.not-gallery-item') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","link":"/hexo-theme-minos/zh-cn/Chinese-Example/"}],"tags":[{"name":"Minos","slug":"Minos","link":"/hexo-theme-minos/zh-cn/tags/Minos/"}],"categories":[{"name":"Documentation","slug":"Documentation","link":"/hexo-theme-minos/zh-cn/categories/Documentation/"}]}